#+title: Nix-config commands (Org Babel)
#+subtitle: Run maintenance commands here (TRAMP-ready)
#+PROPERTY: header-args :results output drawer

This document defines the repository's maintenance commands as runnable
Org Babel blocks.

** Usage
Execute blocks with =C-c C-c= (org-babel-execute-src-block) in Emacs.
TRAMP-ready blocks support remote execution over SSH with sudo elevation.

* switch
Rebuild and activate NixOS configurations locally or remotely.
** local
#+name: rebuild-local
#+begin_src sh :dir (concat "/sudo:arthur@localhost:" (expand-file-name ".")) :async :results raw output drawer
nixos-rebuild switch --flake .#$(hostname) 2>&1
#+end_src
** local with substituters
#+begin_src sh :dir (concat "/sudo:arthur@localhost:" (expand-file-name ".")) :async :results raw output drawer
nixos-rebuild switch --flake .#$(hostname) --option extra-substituters "http://gmktec-k11.tail19d694.ts.net:5000?priority=30" 2>&1
#+end_src

** remote
#+name: select-host
#+begin_src elisp :results value
(completing-read "Select a host" '("x220-nixos" "gmktec-k11" "t480-arthur" "x201-arthur"))
#+end_src

#+name: rebuild-remote
#+begin_src elisp :dir /sshx:gmktec-k11.lan:/home/arthur/src/nix-config/ :var targethost=select-host
(async-shell-command
 (format "NIX_SSHOPTS=\"-C\" nixos-rebuild switch --flake .#%s --target-host %s --ask-sudo-password" targethost targethost))
#+end_src

#+RESULTS: rebuild-remote
: #<process *Async Shell Command*>

* update flake
Update flake inputs to their latest versions.

** Update only the doom-config flake
#+name: update-doom-cmd
#+begin_src sh :async
nix flake update doom-config --commit-lock-file
#+end_src

** Update all flakes
#+name: update-cmd
#+begin_src sh :async
nix flake update --commit-lock-file
#+end_src

* Garbage collect
Remove Nix store items older than 1 day, locally or on selected host.
#+name: gc-remote
#+begin_src elisp :var targethost=select-host
(let* ((current-host (system-name))
       (tramp-path (if (string= targethost current-host)
                       "/sudo::~/"
                     (format "/sshx:%s|sudo:%s:~/" targethost targethost))))
  (let ((default-directory tramp-path))
    (async-shell-command "nix-collect-garbage --delete-older-than 1d")))
#+end_src
* Install when a random live ISO is booted
** Install
#+name: nixos-everywhere
#+begin_src sh :detached t :var configname="t480-arthur" remote="nixos.lan"
nix run github:nix-community/nixos-anywhere -- --generate-hardware-config nixos-generate-config hosts/$configname/hardware-configuration.nix --flake .#$configname --target-host root@$remote  2>&1
#+end_src

#+RESULTS: nixos-everywhere
: [detached]

#+RESULTS:
: [detached]
** Update sops
#+begin_src sh :dir /sshfs:x201-arthur:/home/arthur/ :results raw drawer
rm ~/.ssh/id_ed25519*
ssh-keygen -t ed25519 -f ~/.ssh/id_ed25519 -q -N ""
cat ~/.ssh/id_ed25519.pub
#+end_src

#+RESULTS:
:results:
ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIG7kI68/elpmRp017AlpcbWPrWQwjgzcS00VsDdOJhvs arthur@x201-arthur
:end:

- Add key to .sops.yaml

#+begin_src sh :dir /sshfs:x201-arthur:/home/arthur :results raw drawer
nix-shell -p ssh-to-age --run "ssh-to-age -i ~/.ssh/id_ed25519.pub"
#+end_src

#+RESULTS:
:results:
[35;1mwarning:[0m Nix search path entry '[35;1m/nix/var/nix/profiles/per-user/root/channels[0m' does not exist, ignoring
age1guhcnvfmwqnng9dvfyzlzrlxrd99jrdycp8j0fhrkxvp6nzecy4qc6gldl
:end:

#+begin_src sh :dir /sshfs:x201-arthur:/home/arthur
mkdir -p ~/.config/sops/age/
nix-shell -p ssh-to-age --run "ssh-to-age -private-key -i ~/.ssh/id_ed25519 > ~/.config/sops/age/keys.txt"
#+end_src

#+RESULTS:
| [35;1mwarning:[0m Nix search path entry '[35;1m/nix/var/nix/profiles/per-user/root/channels[0m' does not exist | ignoring |

Update sops secrets with new key
#+begin_src sh
sops updatekeys -y secrets/*
#+end_src

#+RESULTS:
| The                                                            | following                                                      | changes | will | be | made | to | the | file's | groups: |
| Group                                                          | 1                                                              |         |      |    |      |    |     |        |         |
| age1vwc6ywc0a2wpg9d80datnsevlepsepl9u628c26ej6cpj2ky8d8sp2ezhe |                                                                |         |      |    |      |    |     |        |         |
| age192jvd4me826f75hz254ezh77yqp569y4rmur30w4m5mcve02vapq57ttg7 |                                                                |         |      |    |      |    |     |        |         |
| age1649n9a584e79ahpuq752mutvcgphvajrs9hnhrmmv0vsw3cmmy4safmmkv |                                                                |         |      |    |      |    |     |        |         |
| age1aqaey4gyy9meglslfytm3z2uxadq2nvdkthzvytrl8m8uax6lfxqs4lnr4 |                                                                |         |      |    |      |    |     |        |         |
| +++                                                              | age1guhcnvfmwqnng9dvfyzlzrlxrd99jrdycp8j0fhrkxvp6nzecy4qc6gldl |         |      |    |      |    |     |        |         |
| ---                                                            | age1uljz5r599kp6ln47426wcxzzejtt0vdxjuwdyp57y2wj3xm0xp0skrsxwg |         |      |    |      |    |     |        |         |
| The                                                            | following                                                      | changes | will | be | made | to | the | file's | groups: |
| Group                                                          | 1                                                              |         |      |    |      |    |     |        |         |
| age1vwc6ywc0a2wpg9d80datnsevlepsepl9u628c26ej6cpj2ky8d8sp2ezhe |                                                                |         |      |    |      |    |     |        |         |
| age192jvd4me826f75hz254ezh77yqp569y4rmur30w4m5mcve02vapq57ttg7 |                                                                |         |      |    |      |    |     |        |         |
| age1649n9a584e79ahpuq752mutvcgphvajrs9hnhrmmv0vsw3cmmy4safmmkv |                                                                |         |      |    |      |    |     |        |         |
| age1aqaey4gyy9meglslfytm3z2uxadq2nvdkthzvytrl8m8uax6lfxqs4lnr4 |                                                                |         |      |    |      |    |     |        |         |
| +++                                                              | age1guhcnvfmwqnng9dvfyzlzrlxrd99jrdycp8j0fhrkxvp6nzecy4qc6gldl |         |      |    |      |    |     |        |         |
| ---                                                            | age1uljz5r599kp6ln47426wcxzzejtt0vdxjuwdyp57y2wj3xm0xp0skrsxwg |         |      |    |      |    |     |        |         |
